m = [-0.77, 0.93, -1.14, 1.08, 0.87]
n = [0.16, 0.07, -0.17, 0.22, -0.19]
p = [1.12, -0.84, 0.95, -1.16, 1.08]
e = 0.1
print("Каким вы хотите методом?")
print("Нажмите 1 если методом простых итераций 0 если методом Зейделя")
iff = int(input())
if iff:
	print("Метод простых итерации")
	print()
	for i in range(5):
		A = [[m[i], -0.04, 0.21, -0.18], [0.25, -1.23, n[i], -0.09], [-0.21, n[i], 0.8, -0.13], [0.15, -0.31, 0.06, p[i]]]
		B = [-1.24, p[i], 2.56, m[i]]
		x1 = [0]
		x2 = [0]
		x3 = [0]
		x4 = [0]
		for j in range(1, 100):
			x1 += [(-1.24 + 0.04*x2[j-1] - 0.21*x3[j-1] + 0.18*x4[j-1])/m[i]]
			x2 += [(p[i] - 0.25*x1[j-1] - n[i]*x3[j-1] + 0.09*x4[j-1])/-1.23]
			x3 += [(2.56 + 0.21*x1[j-1] - n[i]*x2[j-1] + 0.13*x4[j-1])/0.8]
			x4 += [(m[i] - 0.15*x1[j-1] + 0.31*x2[j-1] - 0.06*x3[j-1])/p[i]]
			if (max(abs(x1[j]-x1[j-1]), abs(x2[j]-x2[j-1]), abs(x3[j]-x3[j-1]), abs(x4[j]-x4[j-1])) <= e):
				print("x1 =", x1[j])
				print("x2 =", x2[j])
				print("x3 =", x3[j])
				print("x4 =", x4[j])
				print("При  m, n, p равных", m[i], n[i], p[i], "соответственно c погрешность", e)
				break
		print()
		print()

else:
	print("Метод Зейделя")
	print()
	for i in range(5):
		A = [[m[i], -0.04, 0.21, -0.18], [0.25, -1.23, n[i], -0.09], [-0.21, n[i], 0.8, -0.13], [0.15, -0.31, 0.06, p[i]]]
		B = [-1.24, p[i], 2.56, m[i]]
		x1 = [0]
		x2 = [0]
		x3 = [0]
		x4 = [0]	
		for j in range(1, 100):
			x1 += [(-1.24 + 0.04*x2[j-1] - 0.21*x3[j-1] + 0.18*x4[j-1])/m[i]]
			x2 += [(p[i] - 0.25*x1[j] - n[i]*x3[j-1] + 0.09*x4[j-1])/-1.23]
			x3 += [(2.56 + 0.21*x1[j] - n[i]*x2[j] + 0.13*x4[j-1])/0.8]
			x4 += [(m[i] - 0.15*x1[j] + 0.31*x2[j] - 0.06*x3[j])/p[i]]
			if (max(abs(x1[j]-x1[j-1]), abs(x2[j]-x2[j-1]), abs(x3[j]-x3[j-1]), abs(x4[j]-x4[j-1])) <= e):
				print("x1 =", x1[j])
				print("x2 =", x2[j])
				print("x3 =", x3[j])
				print("x4 =", x4[j])
				print("При  m, n, p равных", m[i], n[i], p[i], "соответственно c погрешность", e)
				break
		print()
		print()
